[
    {
        "title": "Noise Detector",
        "year": "2024",
        "role": "Engineer",
        "description": "Noise pollution is often overlooked but has significant impacts on health and well-being. Common sources include traffic, industry, construction, and daily urban activities. To manage its effects, noise levels are measured using a sound level meter.",
        "image": "images/project1.png",
        "link": "https://belajarmikrokontroler2k23.blogspot.com/alat-pendeteksi-kebisingan"
    },
    {
        
        "title": "Robot Line Follower",
        "year": "2024",
        "role": "Engineer",
        "description": "A Line Follower Robot is an autonomous vehicle that detects and follows a black or white path using infrared (IR) sensors. The sensors, typically composed of IR LEDs and photodiodes, measure surface reflectivity to distinguish the line from the floor. A microcontroller processes this data and controls the motor driver to adjust wheel speed/direction, ensuring accurate path tracking.",
        "image": "images/project2.png" 
    },
    {
         "title": "This IoT-based Smart Chicken Coop System",
         "year": "2025",
         "role": "Engineer",
         "description": "This IoT-based Smart Chicken Coop System successfully provides an intelligent solution for modern farm management by integrating precision control using STM32 and a web-based interface via Raspberry Pi. The system's advantages lie in its ability to provide real-time monitoring through a responsive web interface, reducing reliance on manual supervision, and improving the quality of life for livestock through a consistently optimal environment. With affordable implementation costs and good scalability, this system not only enhances operational efficiency for small-scale farms but also has the potential to be developed into an integrated industrial solution with AI-based predictive technology in the future.",
         "image": "images/project3.jpg"
    }
]   
